# We install bun immediately because some of our scripts depend on it
system "curl -fsSL https://bun.sh/install | bash"

# Initialize an array to store setapp apps
@setapp_apps = []

def setapp(app, id:)
  @setapp_apps << { id: id, name: app }
end

tap "koekeishiya/formulae"
tap "leonsilicon/formulae"
tap "yqrashawn/goku"
brew "go"
brew "just"
brew "mas"
brew "mkcert"
brew "neovim"
brew "thefuck"
brew "uv"
brew "zoxide"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "leonsilicon/formulae/brainfm"
brew "yqrashawn/goku/goku"
cask "1password"
cask "android-platform-tools"
cask "android-studio"
cask "colorsnapper"
cask "cursor"
cask "daisydisk"
cask "firefox"
cask "git"
cask "google-chrome"
cask "google-chrome@beta"
cask "karabiner-elements"
cask "orbstack"
cask "shortcat"
cask "warp"
vscode "dprint.dprint"
vscode "wakatime.vscode-wakatime"
mas "Xcode", id: 497799835

# Productivity
brew "leonsilicon/formulae/setapp-cli"
cask "cold-turkey-blocker"
cask "dropbox"
cask "lunar"
cask "notion"
cask "raycast"
cask "setapp"
setapp "Bartender", id: 153
setapp "CleanShot X", id: 321
setapp "Clop", id: 612
setapp "Lungo", id: 270
setapp "Movist Pro", id: 344
setapp "Paste", id: 98
setapp "Permute", id: 219
setapp "PixelSnap", id: 358
setapp "Proxyman", id: 346
mas "Toggl Track: Hours & Time Log", id: 1291898086

# Content Creation
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "fxfactory"
cask "minstaller"
cask "screen-studio"
mas "Final Cut Pro", id: 424389933

# Install all setapp apps at the end
ids = @setapp_apps.map { |app| app[:id] }.join(" ")
system("bunx setapp install #{ids}") unless ids.empty?
